{
    "sections": {
      "main": {
        "type": "main-page",
        "disabled": true,
        "settings": {
          "padding_top": 36,
          "padding_bottom": 36
        }
      },
      "bundle-top": {
        "type": "bundle-top",
        "settings": {
        }
      },
      "f9948fed-4ec6-468e-9bbf-3a4a75a5dd7f": {
        "type": "byob",
        "settings": {
        }
      },
      "ff716d20-8482-45f8-8164-c3d4542a3118": {
        "type": "testimonial-slider",
        "blocks": {
          "48d0fd3b-8697-4ef6-aad9-0db0dbd7da00": {
            "type": "slider",
            "settings": {
              "text": "I bought a Titan Power+ cable as a result of solid research and out of desperation. I have an autistic son who has managed to damage every cable he’s ever had. I decided to buy a Titan Power+ cable due to independent reviews I had researched and I am absolutely delighted with it! It has been subjected to some harsh treatment by him and has come out unscathed. Would I buy another? Yes. Would I recommend them? Undoubtedly!",
              "name": "James A.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_15.jpg"
            }
          },
          "c48ff123-d238-4681-b959-92464a6302a3": {
            "type": "slider",
            "settings": {
              "text": "This is by far the best charger I’ve ever had!! The durability, charging speed and construction is second to none. I’m going on my 2nd year with the charger and haven’t had to replace it. I would’ve blitz through the ones I usually get. My OCD is also so relived to have a cable tie to keep it super organised and sleek!",
              "name": "Claire. M",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_1.jpg"
            }
          },
          "9f9eaacf-99fe-475e-b8e8-92850429b914": {
            "type": "slider",
            "settings": {
              "text": "The one thing I love the most: reversible USB plugs! Why haven’t we had these before? I don't have to mess around trying to plug it in when it simply slots in the plug both ways. Why doesn’t Titan Power make a song-and-dance about this feature? I also recently bought the pd plug and it doesn't half charge fast. I love it!",
              "name": "Geffery H.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_19.jpg"
            }
          },
          "40a2076b-9715-4c23-ae05-5511935ff5c4": {
            "type": "slider",
            "settings": {
              "text": "I have bought a few of each of these cables so I did not have to constantly move them around. These are awesome, I use them to charge practically everything, including my Nintendo Switch, tablet and headphones. I alsokeep an extra cable in the car to hook up to my car system and charge my phone when I forget to. I have found their products quite impressive and I will definitely be buying more from them.",
              "name": "David M.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_10.jpg"
            }
          },
          "458fc406-4892-4c1f-ac81-f6ad31369f41": {
            "type": "slider",
            "settings": {
              "text": "The cable is crazy strong. My dog is no match for this baby,. My favorite thing about this cable is the green light. You can always find this in the darkness. Not only can you see that the cable has power, but the light helps you find the end of the cable in the dark or just in a tangled mess of cables. Not having to wait to charge is also a huge bonus. Thanks Titan!",
              "name": "Richard D.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_13.jpg"
            }
          },
          "8adc4c1e-b1e3-4bca-8900-07821cb45773": {
            "type": "slider",
            "settings": {
              "text": "I have had these before and they have really held up and work great! My old one is 7 years old and going strong. They are heavy unlike Apple’s chargers. Every time I get a new Apple device I give their charger away. Theses charge faster and holdup forever and to get 4 charging ports is just great 😊 👍 ! Had to get another my wife has confiscated mine! Lol",
              "name": "Michelle G.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_17.jpg"
            }
          },
          "ef2588e9-1765-46ce-a887-48164c4eedbb": {
            "type": "slider",
            "settings": {
              "text": "Absolutely love the Titan 10-ft charging cables with the 90° connections, the one I ordered five years ago is still an excellent condition. I just had to order a new one for my car and for the misses. You can't beat charging across the room, no idea how I managed before! I also love the green light so I'm not scrambling to find it under my bed at night.",
              "name": "David S.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_14.jpg"
            }
          },
          "dbe4fef6-7c10-4201-ad81-0f39937f037a": {
            "type": "slider",
            "settings": {
              "text": "I will tell you this.. I have been through alot of cables from online and in gas stations. Im an Engineer and when I can tell you this is best and strongest cables I've ever bought. I bought 3 cables because I didnt believe the quality because every talks talks a good game but they've all held out. TITAN is the best charging product company out there bar none. Buy this product if you want quality. They won my business.",
              "name": "Rodrigo R.",
              "image": "shopify:\/\/shop_images\/Titan_smart_cable_titan_power_plus_micro-usb_iphone_type-c_cable_charger_fast_pd_6.jpg"
            }
          }
        },
        "block_order": [
          "48d0fd3b-8697-4ef6-aad9-0db0dbd7da00",
          "c48ff123-d238-4681-b959-92464a6302a3",
          "9f9eaacf-99fe-475e-b8e8-92850429b914",
          "40a2076b-9715-4c23-ae05-5511935ff5c4",
          "458fc406-4892-4c1f-ac81-f6ad31369f41",
          "8adc4c1e-b1e3-4bca-8900-07821cb45773",
          "ef2588e9-1765-46ce-a887-48164c4eedbb",
          "dbe4fef6-7c10-4201-ad81-0f39937f037a"
        ],
        "custom_css": [
  
        ],
        "settings": {
          "title": "DON'T JUST TAKE OUR WORD FOR IT!",
          "subtitle": "Loved and trusted by thousands.."
        }
      },
      "cebc62a1-4552-4cc4-acf9-fe5efafb1d52": {
        "type": "product-image",
        "disabled": true,
        "settings": {
          "image": "shopify:\/\/shop_images\/cable-features-lines.webp",
          "text": "Bending leads to failure, our 90° head prevents bending! Resulting in a lifetime cable that does not fray or wear under common use. With the right angle design, this cable will never get in the way when holding and charging.",
          "title": "Tired of expensive cables constantly breaking?"
        }
      },
      "01915d86-943f-47f5-b7f4-2aa6686ea567": {
        "type": "product-reviews",
        "settings": {
        }
      },
      "ddc12ca1-a081-47f0-a112-e9e295cf6c95": {
        "type": "faq",
        "blocks": {
          "6f865d22-8bed-4c99-bcd3-d8a9ef93e347": {
            "type": "faq",
            "settings": {
              "q": "How rugged is this cable?",
              "a": "We have built this cable with durability in mind and used the strongest, most reliable materials we could find. The robust triple nylon braid braid will keep this cable protected longer than your device. Additionally, the metal connector tips stabilize the ends, where most cables fail."
            }
          },
          "5969e954-e97f-465e-82a6-aeb96779bc4d": {
            "type": "faq",
            "settings": {
              "q": "What devices is this cable compatible with?",
              "a": "Our charging cable will work with all conventional mobile devices, including new releases. We cannot list all the models but see a list of brands below that will support our cable. You can also use our cable to change a whole range of everyday items, such as your speakers, headphones, tablets, cameras and controllers. Please note much larger devices like MacBooks cannot be charged with this cable."
            }
          },
          "dd1c5ffa-e457-4db6-b837-18313b32470f": {
            "type": "faq",
            "settings": {
              "q": "How does the warranty work?",
              "a": "We have so much confidence in our cables durability that we offer a lifetime warranty and 60-day warranty on all other products. This means that if anything happens, we'll send you a brand new charger, free of charge! The warranty covers any defects in material or workmanship. Furthermore, if any unexpected or unreasonable damage occurs this will be covered. Any intentional damage or damage caused by unconventional use will not be covered. Please note that any cable sent out to you as a replacement will not be covered by this warranty."
            }
          },
          "a7335847-cdfa-412a-a0fb-5ba9cd2e493f": {
            "type": "faq",
            "settings": {
              "q": "Is this cable safe to use with my device?",
              "a": "This cable delivers fast charging at an amperage level that is supported by your mobile device and will therefore not cause any damage."
            }
          }
        },
        "block_order": [
          "6f865d22-8bed-4c99-bcd3-d8a9ef93e347",
          "5969e954-e97f-465e-82a6-aeb96779bc4d",
          "dd1c5ffa-e457-4db6-b837-18313b32470f",
          "a7335847-cdfa-412a-a0fb-5ba9cd2e493f"
        ],
        "settings": {
        }
      }
    },
    "order": [
      "main",
      "bundle-top",
      "ff716d20-8482-45f8-8164-c3d4542a3118",
      "f9948fed-4ec6-468e-9bbf-3a4a75a5dd7f",
      "cebc62a1-4552-4cc4-acf9-fe5efafb1d52",
      "01915d86-943f-47f5-b7f4-2aa6686ea567",
      "ddc12ca1-a081-47f0-a112-e9e295cf6c95"
    ]
  }
  